namespace Common
{
    class TemplarGide
    {
        /*
https://4gameforum.com/threads/488606/
фулл ДД
нижняя ветка + Броня баланса, Перехват,Иллюзорный захват, Нижняя защита
парт ДД
нижняя ветка до жажды разрушения + Броня баланса, Перехват, Иллюзорный захват, Устраняющий удар, Раскат грома
саппорт ветка
верхняя + Защитный блок,Восстанавливающая длань, Перехват, Иллюзорный захват

крит 17/HP 47, до белого крита 950, потом HP100
4 свитка стих.защиты 2 бег/атака 2 крит / бфк(бмк)1 еда крик/точность (полезные пельмени с тифабом)
Краткое описание назначений клавиш на скриншоте:
1 панель ( смен. ):
От Shift+1 до Shift+6, 7 ячейка без назначения.
R - ускорение, 3 дп уменя без назначений, клич - Shift+колесо мыши(нажать), ДП удочка - без назначения.
2 панель ( смен. ):
S+Q (баф от щита), S+E,R,T ( умений от щита - атака ), G ( AP банка ), ~ ( крик )
S+X, S+C ( атак умения с щита - вечно активные ), DP пирожок - без назначения, Колесо мыши-нажать (Баночка исцеления),Z,S+Z ( баночки - тикалка, мгновенка )
Основная панель:
1 ряд:
1-5 ( блисталка, обессил, раскат, яростный, правосудие ), A+E ( провоцирующий ), E ( устранялка ), A+4 ( РМУ ), C+R ( РС ), C+Q, C+E ( баф на атаку ), A+Q ( отражалка )
2 ряд:
A+1 ( аш ), А+2 ( АШ удочка ), A+3 ( полет. удочка ), далее без назначения до последних 2 ячеек, Q ( подсечка ), F ( запределка )
3 ряд:
С+1 ( перехват ), C+2 ( веер ), C+3 ( иллюзорка ), далее без назначения - все кликабельно ( предпоследняя ячейка макрос на свитки )
Доп. панель:
Возврат. - без назначений, C+4 ( провокация ), левая доп. мыши 1 ( купол ), правая доп. кнопка мыши ( сильный отпор ), S+доп. мыши 1 ( телескоп двур. ), S+ доп. мыши 2 ( фиол весло ), С+ доп. мыши 1 ( масс агр ), С+ доп. мыши 2 ( масс хил )

HP: 15,000+
Атака: 950+
Точность: 3050+
Крит: 1020+

ББ - Броня баланса
ЗС - Защита союзников
ЗБ - Защитный блок
Сало - Немота
Песок - Песчаная ловушка
КБ - Каменная броня
ПБ - Покров богов
Рут - Корни / обездвиживание

20   Перехват I
20-30 Наказание I, Перехват I и Подсечка I. ЗАМЕНА: Возмущение I и Броня баланса I.
40   Перехват I, Броня баланса I, Наказание III, Подсечка II. ЗАМЕНА: Наказание III на Раскат грома I

45.1 Перехват I, Броня баланса I, Наказание III, Подсечка II, Вызов гнева III, Реанимация I
45.2 Перехват I, Броня баланса I, Наказание III, Подсечка II, Защита союзников I, Защитный блок I
45.3 Перехват I, Броня баланса I, Наказание III, Подсечка II, Раскат грома I, Защитный блок I

50.1 Перехват I, Броня баланса I, Наказание IV, Подсечка III, Раскат грома I, Защитный блок I, 
     Крик ужаса I, Охранный щит III
50.2 Перехват I, Броня баланса I, Наказание IV, Подсечка III, Раскат грома I, Защитный блок I, 
     Реанимация II, Вызов гнева IV
50.3 Перехват I, Броня баланса I, Наказание IV, Подсечка III, Раскат грома I, Защитный блок I, 
     Крик ужаса I, Защита союзников II
50*4 Перехват I, Подсечка III, Охранный щит III, Возмущение I, Разрушительный магический удар II, Разрушение сознания II, 
     Жажда разрушения I 
	 === Броня баланса I/Наказание IV/Раскат грома I/Защитный блок I/Защита союзников II
50.5 Перехват I, Вызов гнева IV, Реанимация II, Защита союзников II, Издевательский хохот V, Доспехи покровительства II, 
     Прочный щит I
	 === Броня баланса I/Наказание IV/Раскат грома I/Защитный блок I/Подсечка III

55.1 Перехват I, Броня баланса I, Наказание V, Подсечка IV, Защитный блок I, Вызов гнева V, 
     Реанимация IV, Охранный щит IV, Волна оков II, Защита союзников II, (Раскат грома II / Крик ужаса I)
55.2 Перехват I, Подсечка IV, Охранный щит IV, Возмущение I, Разрушительный магический удар IV, Разрушение сознания IV, 
     Жажда разрушения I, Защитный блок I, Броня баланса I, , (Наказание V / Защита союзников II), Раскат грома II
	 
60.1 Перехват I, Наказание VI, Броня баланса I, Подсечка V, Защитный блок I, Вызов гнева VI, 
     Реанимация VI, Охранный щит IV, Защита союзников III, Раскат грома III, Иллюзорный захват I, Нижняя защита I
	 === (Волна оков III + Разрушительный магический удар VI) / (Разрушение сознания VI + Возмущение I)
60.2 Перехват I, (Броня баланса I / Нижнюю защиту I), (Наказание VI / Защита союзников III), Подсечка V, (Защитный блок I / Защитного блока I), Охранный щит IV, 
     Раскат грома III, Иллюзорный захват I, Возмущение I, Разрушительный магический удар VI, Разрушение сознания VI
60.3 Перехват I, Броня баланса I, Защита союзников III, Доспехи покровительства VI, Прочный щит I, Подсечка V, 
     Нижняя защита I, (Раскат грома III / Наказание VI), Иллюзорный захват I, Вызов гнева VI, Реанимация VI, Издевательский хохот VI
	 
        */
    }
}
